//Лаба 2
#include <iostream>
using namespace std;

short int A, B;

int main() {
    cin >> A >> B;
    cout << 2*(A + B) << endl;
}

/*
Вариант 3.
Написать программу, которая, используя минимальное количество оперативной памяти рассчитает, периметр прямоугольника со сторонами A и B (0 < A,B < 20). A и B считать с клавиатуры
*/